# CourseData Tests

In [1]:
%load_ext sql

In [2]:
%%sql 
sqlite:///CourseData.db

'Connected: @CourseData.db'

# Domain Integrity Queries -- the allowed values of an attribute determin domain integrity, definitions include data type, length, range or constraints

# -query checks that CourseID, Catalog_ID, Title are correct when provided Program_Code and Program_Name

In [4]:
%%sql
SELECT course_ID, catalog_ID,Course_Title,program_code,program_name
FROM COURSES
    LEFT JOIN PROGRAMS USING (program_id)
    LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(1, 'AN 0301', 'Independent Study', 'AN', 'Asian Studies'),
 (2, 'AN 0310', 'Asian Studies Seminar', 'AN', 'Asian Studies'),
 (3, 'BU 0211', 'Legal Environment of Business', 'BU', 'Business'),
 (4, 'BU 0220', 'Environmental Law and Policy', 'BU', 'Business'),
 (5, 'BU 0311', 'The Law of Contracts, Sales, and Property', 'BU', 'Business'),
 (6, 'BU 0312', 'The Law of Business Organizations and Financial Transactions', 'BU', 'Business'),
 (7, 'BU 0320', 'Employment Law and Discrimination in the Workplace', 'BU', 'Business'),
 (8, 'BU 0391', 'Seminar in Business Law and Ethics', 'BU', 'Business'),
 (9, 'BL 0101', 'Black Lives Matter', 'BL', 'Black Studies'),
 (10, 'BL 0398', 'Independent Study', 'BL', 'Black Studies')]

# Entity Integrity Queries -- testing to ensure that each object represented by a row in the table should be distiguishable from any other object (unique entity or do the # of records in each table look right)

In [9]:
%%sql
SELECT count(Catalog_ID)
FROM COURSES;

 * sqlite:///CourseData.db
Done.

[(4440,)]

In [10]:
%%sql
SELECT DISTINCT count (Catalog_ID)
FROM COURSES;

 * sqlite:///CourseData.db
Done.

[(4440,)]

In [7]:
%%sql
SELECT count (Program_name)
FROM PROGRAMS;

 * sqlite:///CourseData.db
Done.

[(83,)]

In [8]:
%%sql
SELECT DISTINCT count(Program_name)
FROM PROGRAMS;

 * sqlite:///CourseData.db
Done.

[(83,)]

In [11]:
%%sql
SELECT count (crn)
FROM COURSE_OFFERINGS;

 * sqlite:///CourseData.db
Done.

[(15937,)]

In [13]:
%%sql
SELECT count (Meetings)
FROM COURSE_OFFERINGS;

 * sqlite:///CourseData.db
Done.

[(15937,)]

In [5]:
%%sql
SELECT count (name)
FROM PROFESSORS;

 * sqlite:///CourseData.db
Done.

[(1104,)]

In [6]:
%%sql
SELECT DISTINCT count (name)
FROM PROFESSORS;

 * sqlite:///CourseData.db
Done.

[(1104,)]

In [14]:
%%sql
SELECT count(start)
FROM MEETINGS;

 * sqlite:///CourseData.db
Done.

[(284847,)]

In [15]:
%%sql
SELECT count (end)
FROM MEETINGS;

 * sqlite:///CourseData.db
Done.

[(284847,)]

In [16]:
%%sql
SELECT count (location)
FROM LOCATIONS;

 * sqlite:///CourseData.db
Done.

[(207,)]

In [17]:
%%sql
SELECT DISTINCT count (location)
FROM LOCATIONS;

 * sqlite:///CourseData.db
Done.

[(207,)]

# Relational Integrity Queries -- testing to ensure that etabel relationships are consistent, or that any foreign key field must agree with the primary key that is referenced by the foreign key